CSI API ETABS v1
cPropArea.GetDeck_1 Method
 Retrieves property data for a deck section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDeck_1(
	string Name,
	ref eDeckType DeckType,
	ref string SlabFillMatProp,
	ref string DeckMatProp,
	ref double SlabDepth,
	ref double RibDepth,
	ref double RibWidthTop,
	ref double RibWidthBot,
	ref double RibSpacing,
	ref double DeckShearThickness,
	ref double DeckUnitWeight,
	ref double ShearStudDia,
	ref double ShearStudHs,
	ref double ShearStudFu,
	ref int color,
	ref string notes,
	ref string GUID
)
Function GetDeck_1 (
	Name As String,
	ByRef DeckType As eDeckType,
	ByRef SlabFillMatProp As String,
	ByRef DeckMatProp As String,
	ByRef SlabDepth As Double,
	ByRef RibDepth As Double,
	ByRef RibWidthTop As Double,
	ByRef RibWidthBot As Double,
	ByRef RibSpacing As Double,
	ByRef DeckShearThickness As Double,
	ByRef DeckUnitWeight As Double,
	ByRef ShearStudDia As Double,
	ByRef ShearStudHs As Double,
	ByRef ShearStudFu As Double,
	ByRef color As Integer,
	ByRef notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim DeckType As eDeckType
Dim SlabFillMatProp As String
Dim DeckMatProp As String
Dim SlabDepth As Double
Dim RibDepth As Double
Dim RibWidthTop As Double
Dim RibWidthBot As Double
Dim RibSpacing As Double
Dim DeckShearThickness As Double
Dim DeckUnitWeight As Double
Dim ShearStudDia As Double
Dim ShearStudHs As Double
Dim ShearStudFu As Double
Dim color As Integer
Dim notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetDeck_1(Name,
	DeckType, SlabFillMatProp, DeckMatProp,
	SlabDepth, RibDepth, RibWidthTop,
	RibWidthBot, RibSpacing, DeckShearThickness,
	DeckUnitWeight, ShearStudDia, ShearStudHs,
	ShearStudFu, color, notes, GUID)
int GetDeck_1(
	String^ Name,
	eDeckType% DeckType,
	String^% SlabFillMatProp,
	String^% DeckMatProp,
	double% SlabDepth,
	double% RibDepth,
	double% RibWidthTop,
	double% RibWidthBot,
	double% RibSpacing,
	double% DeckShearThickness,
	double% DeckUnitWeight,
	double% ShearStudDia,
	double% ShearStudHs,
	double% ShearStudFu,
	int% color,
	String^% notes,
	String^% GUID
)
abstract GetDeck_1 :
        Name : string *
        DeckType : eDeckType byref *
        SlabFillMatProp : string byref *
        DeckMatProp : string byref *
        SlabDepth : float byref *
        RibDepth : float byref *
        RibWidthTop : float byref *
        RibWidthBot : float byref *
        RibSpacing : float byref *
        DeckShearThickness : float byref *
        DeckUnitWeight : float byref *
        ShearStudDia : float byref *
        ShearStudHs : float byref *
        ShearStudFu : float byref *
        color : int byref *
        notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing deck property.
DeckType
Type: ETABSv1.eDeckType
 This is one of the items in the eDeckType enumeration, which is Filled, Unfilled, or SolidSlab
SlabFillMatProp
Type: System.String
The name of the material property for the slab/fill property. This applies if DeckType is Filled or SolidSlab
DeckMatProp
Type: System.String
The name of the material property for the deck property. This applies if DeckType is Filled or Unfilled
SlabDepth
Type: System.Double
Slab Depth, tc. This applies if DeckType is Filled or SolidSlab
RibDepth
Type: System.Double
Rib Depth, hr. This applies if DeckType is Filled or Unfilled
RibWidthTop
Type: System.Double
Rib Width Top, wrt. This applies if DeckType is Filled or Unfilled
RibWidthBot
Type: System.Double
Rib Width Bottom, wrb. This applies if DeckType is Filled or Unfilled
RibSpacing
Type: System.Double
Rib Spacing, sr. This applies if DeckType is Filled or Unfilled
DeckShearThickness
Type: System.Double
Deck Shear Thickness. This applies if DeckType is Filled or Unfilled
DeckUnitWeight
Type: System.Double
Deck Unit Weight. This applies if DeckType is Filled or Unfilled
ShearStudDia
Type: System.Double
Shear Stud Diameter. This applies if DeckType is Filled or SolidSlab
ShearStudHs
Type: System.Double
Shear Stud Height, hs. This applies if DeckType is Filled or SolidSlab
ShearStudFu
Type: System.Double
Shear Stud Tensile Strength, Fu. This applies if DeckType is Filled or SolidSlab
color
Type: System.Int32
The display color assigned to the property.
notes
Type: System.String
The notes, if any, assigned to the property.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
 The function returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Imports [Namespace]
Public Sub Example()
       Dim SapModel As [Namespace].cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim DeckType As eDeckType
       Dim SlabDepth As Double
       Dim RibDepth As Double
       Dim RibWidthTop As Double
       Dim RibWidthBot As Double
       Dim RibSpacing As Double
       Dim DeckShearThickness As Double
       Dim DeckUnitWeight As Double
       Dim ShearStudDia As Double
       Dim ShearStudHs As Double
       Dim ShearStudFu As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
    'set new area property
       Name = "MyShellProp1A"
       DeckType = eDeckType.Filled
       SlabFillMatProp = "4000Psi"
       DeckMatProp = "A992Fy50"
       SlabDepth = 15.6
       RibDepth = 1.1
       RibWidthTop = 2.3
       RibWidthBot = 2.4
       RibSpacing = 7
       DeckShearThickness = 5
       DeckUnitWeight = 3.1
       ShearStudDia = 1.02
       ShearStudHt = 4.4
       ShearStudFu = 2.01
       ret = mySapModel.PropArea.SetDeck_1(Name, DeckType, SlabFillMatProp, DeckMatProp, SlabDepth, RibDepth, RibWidthTop, RibWidthBot, RibSpacing, DeckShearThickness, DeckUnitWeight, ShearStudDia, ShearStudHt, ShearStudFu, color, notes, GUID)
       DeckType = eDeckType.SolidSlab
       SlabFillMatProp = ""
       DeckMatProp = ""
       SlabDepth = 0
       RibDepth = 0
       RibWidthTop = 0
       RibWidthBot = 0
       RibSpacing = 0
       DeckShearThickness = 0
       DeckUnitWeight = 0
       ShearStudDia = 0
       ShearStudHt = 0
       ShearStudFu = 0
    'get area property data
       ret = mySapModel.PropArea.GetDeck_1(Name, DeckType, SlabFillMatProp, DeckMatProp, SlabDepth, RibDepth, RibWidthTop, RibWidthBot, RibSpacing, DeckShearThickness, DeckUnitWeight, ShearStudDia, ShearStudHt, ShearStudFu, color, notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace